package index.综合题系列1;

/**
 * 作者：君若雅
 * 链接：https://www.nowcoder.com/discuss/40811
 * 来源：牛客网
 * <p>
 * 1.数组中找出所有重复数字？空间复杂度为O（1），时间复杂度最小？
 * 实在没有O(1)的方法，只能实现O（n），欢迎讨论。
 * 方案1：创建n个数字的数组，循环相加，将大于1的数字打印出来
 * 方案2：map，先contains判断，存在就打印，不存在就put
 * <p>
 * 2.一个二维数组只含0，1；将1围城的矩阵中所有的0的数字转换成1？
 * <p>
 * 3.求链表中点？
 * <p>
 * 4. 手写常用设计模式（单例）
 * 饿汉懒汉的区别、好处、缺点都要会
 * 这里可能会引申出单例的条件，详见：http://www.runoob.com/design-pattern/singleton-pattern.html
 * <p>
 * 5.手写生产者消费者模式？
 * <p>
 * 6.100个0到100之间的整数排序
 * <p>
 * 7.two sum问题到k sum问题
 * <p>
 * 8.旋转数组二分查找
 * <p>
 * 9.算 a + b, 不能用加号或减号
 * 位运算，大家百度一下就可以了
 * <p>
 * 10. 数组中超过一半的数
 * <p>
 * 11. 大文件100亿个数字，求前m大的数
 * <p>
 * 12.两个有序数组，求第k个数
 * <p>
 * 13.最大连续子数组和
 * 基础题，贪心。
 * <p>
 * 14.二维数组中，每个元素有个数字，求某一个点到任意一点的sum和（只能向右或者向下） dp记录到每个点的sum
 * <p>
 * 15.手写快速排序算法，并解释过程。
 * <p>
 * 16.重建二叉树
 * <p>
 * 17.二分查找
 * <p>
 * 18.从字符串中“aecbcda”找出不重复的字符组成的顺序子串“aecbd”,用最优的时空复杂度。
 * <p>
 * 19.判断一个链表是否有环（我回答快慢指针，因此引出下一个问题）
 * 两个指针，一个走1步，一个走2步，龟兔赛跑问题
 * <p>
 * 20.一个数组，有正有负，把正的移到右边，负的移到左边。
 * <p>
 * 21.两个队列实现栈
 * 《剑指Offer》原题
 * <p>
 * 22.括号匹配
 * 堆匹配
 * <p>
 * 23.链表反转的操作，参数结构自己设计
 * <p>
 * 24.一个数组，实现原地反转
 * <p>
 * 25.一个只包含小写字母的字符串，去重生成一个只包含单一字母的字符串。例如“abadcab”变成"abdc"，只让用最多一个额外的int变量
 * <p>
 * 26.大数加法代码
 * <p>
 * 27.推排序
 * <p>
 * 28.给一个字符串，由26个英文字母组成，判断其中有没有重复出现的元素，有返回true，没有返回false
 * <p>

 * Created by wangzhe.bj on 2017/12/4.
 */
public class _题目说明 {


}
